#### CutMarkSymbol Enumeration

---

|  |
| --- |
| See Also |

The available shapes for the cut mark symbol.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum CutMarkSymbol ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration CutMarkSymbol ``` |

| Visual C++ |
| --- |
| ``` public enum class CutMarkSymbol ``` |

# Members

| Member name | Description |
| --- | --- |
| None | Cut mark shape is linear. |
| Zigzag | Cut mark shape is zigzagged. |
| Curve | Cut mark shape is curved. |

# See Also

Autodesk.Revit.DB.Architecture Namespace